Revit 2027 API
FailuresAccessor.IsPending Method
 Checks if the failure processing is pending.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPending()
Public Function IsPending As Boolean
public:
bool IsPending()
member IsPending : unit -> bool
Return Value
Boolean
 True if the failures processing is in the pending state.
Exceptions
Exception | Condition
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
Remarks
 The failure processing is pending after failures processor has returned WaitForUserInput and until pending state is finished by either committing or rolling back of the pending transaction.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace